[
  {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6a",
      "category_id": "01",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "Computer Fundamentals",
      "author": {
        "name": "Jimmy Dane"
      },
      
      "image_url": "https://m.media-amazon.com/images/I/41qzVdWeIIL._SX356_BO1,204,203,200_.jpg",
      
      "details": "Computer is a device that transforms data into meaningful information.Data can be anything like marks obtained by you in various subjects.It can also be name,age,sex,weight,height,etc. of all the students in a class.Computer can also be defined  in terms of functions.Computer is an advanced electronic device that takes raw data as an input from the user and processes it under the control of a set of instructions (called program), produces a result (output), and saves it for future use. This tutorial explains the foundational concepts of computer hardware, software, operating systems, peripherals, etc. along with how to get the most value and impact from computer technology.  "
    },
     {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6",
      "category_id": "02",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "Programming and Problem Solving",
      "author": {
        "name": "Jimmy Dane"
      },
      
      "image_url": "https://d3gy99intf9w7w.cloudfront.net/2187-large_default/computer-programming-volume-1.jpg",
      
      "details": "Whether you’re looking to begin coding as a hobby, a new career, or just to enhance your current role, the first thing you’ll have to do is decide which programming language you want to start with.There is no right answer, of course. Choosing a first language will depend on what kind of projects you want to work on, who you want to work for, or how easy you want it to be. Hopefully, this guide will help give you a better idea of which one you should pursue.BASIC was an early programming language that is still among the simplest and most popular of programming languages. BASIC stands for Beginner's All-purpose Symbolic Instruction Code. Originally designed as an interactive mainframe timesharing language by John Kemeney and Thomas Kurtz in 1963, it became widely used on personal computers everywhere.  On IBM's firstcomputer, the PCJr, a BASIC cartridge was a popular add-on. Because of its simplicity, BASIC has frequently been used in teaching the introductory concepts of programming with a working language. "
    },
     {
      "_id": "0282e0e58a5c404fbd15261f11c2ab",
      "category_id": "03",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "Data Structures",
      "author": {
        "name": "Jimmy Dane"
      },
      
      "image_url": "https://qph.cf2.quoracdn.net/main-qimg-bd05bec96c4ce1cf26e3c48165985e2d.webp",
      
      "details": "A data structure is not only used for organizing the data. It is also used for processing, retrieving, and storing data. There are different basic and advanced types of data structures that are used in almost every program or software system that has been developed. So we must have good knowledge about data structures.For programmers, algorithms and data structures are their most essential subjects—a programmer’s bread and butter if you will. If you want to enter the field of programming and hit the ground running, you’ll need to master the most common data structures and boost your resume with in-demand skills.Here, we’ll explore the eight most important data structures every programmer should know, including what they do and where to use them. To start, let’s gain a fundamental understanding of what a data structure is.  "
    },
     {
      "_id": "0282e0e58a5c404fbd15261f11c2a",
      "category_id": "04",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "Object Oriented Programming",
      "author": {
        "name": "Jimmy Dane"
      },
      
      "image_url": "https://data03.123doks.com/thumbv2/123dok/002/011/2011399/cover.webp",
      
      "details": "Object-oriented programming combines a group of data attributes with functions or methods into a unit called an object. Typically, OOP languages are class-based, which means that a class defines the data attributes and functions as a blueprint for creating objects, which are instances of the class. Popular class-based OOP languages include Java, Python and C++. Multiple independent objects may be instantiated—or represented—from the same class and interact with each other in complex ways.A simple example would be a class representing a person. The person class would contain attributes to represent information such as the person’s age, name, height, etc. The class definition might also contain functions such as sayMyName which would simply print that person’s name to the screen.A family could be constructed by instantiating person objects from the class for each member of the family. Each person object would contain different data attributes since each person is unique. "
    },
     {
      "_id": "0282e0e58a5c404fbd15261f11c2",
      "category_id": "05",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "Algorithms",
      "author": {
        "name": "Jimmy Dane"
      },
      
      "image_url": "https://images-eu.ssl-images-amazon.com/images/I/513P8XoCAEL._AC._SR360,460.jpg",
      
      "details": "A programming algorithm is a procedure or formula used for solving a problem. It is based on conducting a sequence of specified actions in which these actions describe how to do something, and your computer will do it exactly that way every time. An algorithm works by following a procedure, made up of inputs. Once it has followed all the inputs, it will see a result, also known as output.The word algorithm was first coined in the 9th century. Algorithms are all around us. Common examples include: the recipe for baking a cake, the method we use to solve a long division problem, the process of doing laundry, and the functionality of a search engine are all examples of an algorithm.   "
    },
     {
      "_id": "0282e0e58a5c404fbd15261f11c",
      "category_id": "06",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "Data Communication",
      "author": {
        "name": "Jimmy Dane"
      },
      
      "image_url": "https://cdn01.sapnaonline.com/bk_images/700/9789350141700.jpg",
      
      "details": "Data communications incorporate several techniques and technologies to enable any form of electronic communication. It’s a very broad way to refer to all of this networked technology on any platform or in any digital environment.Some common types of data communications technologies include telecommunications, computer networking and radio/satellite communication. Data communication usually requires the existence of a transportation or communication medium between the nodes wanting to communicate with each other, such as copper wire, fiber optic cables, or wireless signals.For example, a common example of data communications is a computer connected to the Internet via a Wi-Fi connection, which uses a wireless medium to send and receive data from one or more remote servers.Some devices/technologies used in data communications are known as data communication equipment (DCE) and data terminal equipment (DTE). DCE is used at the sending node, and DTE is used at the receiving node.Another way to talk about different types of data communications is to refer to the functionality that is available for a sender and a receiver to use. In terms of communications function, you have simplex communications, which are only one-way data communications, and you have half-duplex and full-duplex data communications models, as well as serial data communications."
    },
     {
      "_id": "0282e0e58a5c404fbd15261f11",
      "category_id": "07",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "Computer Networks",
      "author": {
        "name": "Jimmy Dane"
      },
      
      "image_url": "https://5.imimg.com/data5/FS/AH/GLADMIN-17084875/computer-networks-book-500x500.png",
      
      "details": "Computer networks share common devices, functions, and features including servers, clients, transmission media, shared data, shared printers and other hardware and software resources, network interface card(NIC), local operating system(LOS), and the network operating system (NOS).Servers - Servers are computers that hold shared files, programs, and the network operating system. Servers provide access to network resources to all the users of the network. There are many different kinds of servers, and one server can provide several functions. For example, there are file servers, print servers, mail servers communication servers, database servers, fax servers and web servers, to name a few. Sometimes it is also called host computer, servers are powerful computer that store data or application and connect to resources that are shared by the user of a network.Clients - Clients are computers that access and use the network and shared network resources. Client computers are basically the customers(users) of the network, as they request and receive services from the servers. These days, it is typical for a client to be a personal computer that the users also use for their own non-network applications.Transmission Media - Transmission media are the facilities used to interconnect computers in a network, such as twisted-pair wire, coaxial cable, and optical fiber cable. Transmission media are sometimes called transmission medium channels, links or lines.Shared data - Shared data are data that file servers provide to clients such as data files, printer access programs and e-mail.Shared printers and other peripherals - Shared printers and peripherals are hardware resources provided to the users of the network by servers. Resources provided include data files, printers, software, or any other items used by clients on the network."
    }
  
   
]